; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_1 ?v1 - type_2 ?v5 - type_1)
 	      (pred_4 ?v3 - object ?v5 - type_1)
	      (pred_2 ?v1 - type_2 ?v8 - type_3)
	      (pred_3 ?v1 - type_2 ?v3 - object ?v8 - type_3))

   (:action op_1
       :parameters  (?v1 - type_2 ?v6 ?v4 - type_1)
       :precondition (and  (pred_1 ?v1 ?v6))
       :effect (and  (pred_1 ?v1 ?v4)
		     (not (pred_1 ?v1 ?v6))))

   (:action op_3
       :parameters (?v1 - type_2 ?v2 - object ?v7 - type_1 ?v8 - type_3)
       :precondition  (and  (pred_4 ?v2 ?v7) (pred_1 ?v1 ?v7) (pred_2 ?v1 ?v8))
       :effect (and (pred_3 ?v1 ?v2 ?v8)
		    (not (pred_4 ?v2 ?v7)) 
		    (not (pred_2 ?v1 ?v8))))

   (:action op_2
       :parameters (?v1 - type_2 ?v2 - object ?v7 - type_1 ?v8 - type_3)
       :precondition  (and  (pred_3 ?v1 ?v2 ?v8) (pred_1 ?v1 ?v7))
       :effect (and (pred_4 ?v2 ?v7)
		    (pred_2 ?v1 ?v8)
		    (not (pred_3 ?v1 ?v2 ?v8)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_01 - type_2
obj_07 obj_04 - type_3
obj_08 obj_09 obj_05 obj_06 - type_1
obj_10 obj_02 obj_03 - object)
(:init
(pred_1 obj_01 obj_09)
(pred_2 obj_01 obj_07)
(pred_2 obj_01 obj_04)
(pred_4 obj_10 obj_09)
(pred_4 obj_02 obj_05)
(pred_4 obj_03 obj_08)
)
(:goal
(and
(pred_4 obj_10 obj_06)
(pred_4 obj_02 obj_06)
(pred_4 obj_03 obj_08)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_01 ?b obj_04))))
)
)

; plan
1. (op_3 obj_01 obj_10 obj_09 obj_07)
   deleted: (pred_4 obj_10 obj_09) (pred_2 obj_01 obj_07)
   added: (pred_3 obj_01 obj_10 obj_07)
   goals met: 1 of 3
2. (op_1 obj_01 obj_09 obj_06)
   deleted: (pred_1 obj_01 obj_09)
   added: (pred_1 obj_01 obj_06)
   goals met: 1 of 3
3. (op_2 obj_01 obj_10 obj_06 obj_07)
   deleted: (pred_3 obj_01 obj_10 obj_07)
   added: (pred_4 obj_10 obj_06) (pred_2 obj_01 obj_07)
   goals met: 2 of 3
4. (op_1 obj_01 obj_06 obj_05)
   deleted: (pred_1 obj_01 obj_06)
   added: (pred_1 obj_01 obj_05)
   goals met: 2 of 3
5. (op_3 obj_01 obj_02 obj_05 obj_07)
   deleted: (pred_4 obj_02 obj_05) (pred_2 obj_01 obj_07)
   added: (pred_3 obj_01 obj_02 obj_07)
   goals met: 2 of 3
6. (op_1 obj_01 obj_05 obj_06)
   deleted: (pred_1 obj_01 obj_05)
   added: (pred_1 obj_01 obj_06)
   goals met: 2 of 3
7. (op_2 obj_01 obj_02 obj_06 obj_07)
   deleted: (pred_3 obj_01 obj_02 obj_07)
   added: (pred_4 obj_02 obj_06) (pred_2 obj_01 obj_07)
   goals met: 3 of 3
